{
    "pages": { 
        "home": {
            "title": "Webalkalmazás célja" ,
            "introduction": "Az alkalmazás a jelszó gépelési ritmusok megismerésébe nyújt betekintést, melyet öt különböző szempontból is megtekinthetnek. ",
            "content1": "Öt olyan gépelési ritmust tartalmazó adathalmaz áll rendelkezésünkre, melyek különböző számú felhasználó adatait tartalmazzák. Ezekről az adathalmazokról bővebben olvashatszt az ",
            "datasets": "Adathalmazok",
            "content2": " menüpont alatt. A felhasználó tehát öt adathalmazból választhatja ki, hogy a továbbiakban melyikkel szeretne dolgozni, melyiket szeretné megtekinteni. Két fő funkcionalitást tudunk elkülöníteni:", 
            "listing": {
                "dataAnalysis": "Adatelemzés",
                "performanceAnalysis": "Teljesítményelemzés"
            },
            "data": "Az adatelemzési funkcionalitás a kiválaszott adathalmaz függvényében két típusú diagramot mutat be. Az egyik a jellemzők hisztogramja, mely az összes felhasználó értéket igénybe véve készül; a másik a gépelési ritmusok vonaldigramja, mely kimondottam egy felhasználó gépelési adataiból épül fel. Alapértelmezettem a hisztogramok kerülnek betöltésre és a sapipin a standard adathalmaz.",
            "performance": "A teljesítményelemzés opciónál két lehetőség adott: Detektor kategória és Detektor menüpont. Az elsőt választva adottak az adathalmazok és a detektor kategóriák. A  felhasználó kedvére válaszhat egy adathalmazt és egy kategóriát és ezek függvényében megketintheti az adott kategóriában lévő detektorok teljesítményét ROC görgék által a kiválasztott adathalmazra. Továbbá egy más típusú diagramot is szemügyre vehet, mégpedig dobozdiagramot, amelyek szintén a detektorok teljesítményét tükrözik. Az alapértelmezetten kiválasztott adathalmaz a sapipin, a detektor kategória pedig a Lineáris modellek. Abban az esetben, hogy ha a Detektor almenüpontot választja, akkor az oldalon eltünnek az adathalmazok, csupán a kategóriában lévő detektorok közül választhat a felhaszbnáló ( bármelyik detektort ). A megjelenő dobozdiagramok a kiválaszott detektor AUC , majd EER értékeit személtetik mint az öt adathalmazra, összehasonlítva ezáltal a teljesítményt. Az alapértelmezettem kiválaszott detektor a PCA."
        },
        "datasets":{
            "title": "Adathalmazok ismertetése" 
        },
        "basic-concepts":{
            "title": "Alapfoglamak, jelölések",
            "subtitle1" : "Alapfoglamak",
            "listing1" : {
                "anomalyDetection": "Anomália detektálás: egy olyan eljárás, amely különböző algoritmusokat használva képes meghatározni egy adott adatról, hogy mennyire tér el az előzőleg begyűjtött adatokból előállított modelltől",
                "class": "Osztályozás: előre definiált osztályokba soroljuk a különböző mintákat",
                "tp": "Igaz pozitív (TP: true positive): modell által helyesen prediktált pozitív esetek száma.",
                "fn": "Hamis negatív (FN: false negative): azon pozitív esetek száma, amelyeket a modell tévesen negatívként prediktál.",
                "fp": "Hamis pozitív (FP: false positive): azon negatív esetek száma, amelyeket a modell tévesen pozitívként prediktál.",
                "tn": "Igaz negatív (TN: true negative): amely az osztályozási modell által helyesen prediktált negatív esetek száma",
                "precision": "Pontosság = TP/(TP+FP): megmutatja, hogy a pozitívként felismertek hányad része volt valóban pozitív" ,
                "hist": "A hisztogram metrikusan skálázott tulajdonságok grafikus ábrázolása",
                "box": "A dobozdiagram egy módszer a numerikus adatok lokalizációjának, terjedésének és ferdeségi csoportjainak grafikus bemutatására a kvartiliseiken keresztül."
            },
            "subtitle2" : "Jelölések",
            "listing2":{
                "auc": "AUC - Area Under the ROC Curve: ROC görbe alatti terület;  kifejezi, hogy mennyire soroljuk a pozitív mintákat a negtívak elé a tesztelés folyamán.",
                "eer": "EER - Equal Error Rate: egyenlő hibaarány",
                "ht": "HT - Hold Time: egy billentyű lenyomása és felengedése közti idő",
                "dd": "DD - Down-Down: két egymástkövető billentyű lenyomása közti idő",
                "ud": "UD - Up-Down: az egyik billentyű felengedése és a rákövetkező billentyű lenyomása közti idő",
                "tpr": "TPR: Igaz pozitívak aránya = TP/(összes pozitívok száma)",
                "fpr": "FPR: Hamis pozitívak aránya: FP/(összes negatívok száma)",
                "fnr": "FNR: Hamis negatívak aránya: FN/(összes pozitívok száma)",
                "tnr": "TNR: Igaz negatívak aránya: TN/(összes negatívok száma)"
            }
        },
        "data-analysis":{
            "title" : "Adatelemzés"
        }
       
    },

    "shared": {
        "header":{
            "title": "Anomália detektálás jelszó gépelés esetében"
        },
        "menu": {
            "listing":{
                "home": "Főoldal",
                "datasets": "Adathalmazok",
                "basicConcepts": "Alapfogalmak",
                "dataAnalysis": "Adatelemzés",
                "performanceAnalysis": "Teljesítményelemzés"
            },
            "submenu":{
                "detectorgroup": "Detektor kategória",
                "detector": "Detektor"
            }
        },
        "datasidebar":{
            "hist": "Hisztogramok",
            "typing": "Gépelési ritmusok"
        },
        "sidebar":{
            "title": "Adathalmazok"
        },
        "footer":{
            "title": "© 2022 - Demény Zsófia - Diplomadolgozat"
        }
    },
    "detectorGroups": {
        "linear": "Lineáris modellek",
        "proximityBased": "Közelségalapú modellek",
        "probabilistic": "Valószínűségi modellek",
        "outlierEnsembles": "Ensemble típusú modellek"
    }



    
}